// const { render } = require("sass");

document.addEventListener('DOMContentLoaded', () => {
  const table = document.querySelector('.table__main'),
    tbody = table.querySelector('tbody');
  const data = [
    ["Адонис", "Раисы Окипной", "Клиника", "категория-1"],
    ["Добробут", "Бажана", "Клиника", "категория-2"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"],
    ["Синево", "Окипной", "Лаборатория", "Без категории"]
  ];

  class createRows {
    constructor(name, adr, type, category) {
      this.name = name;
      this.adr = adr;
      this.type = type;
      this.category = category;
    }

    render() {
      table.classList.remove('table-bordered');
      const row = document.createElement('tr');
      row.innerHTML = `
    <td scope="col">${this.name}</td>
    <td scope="col">${this.adr}</td>
    <td scope="col">${this.type}</td>
    <td scope="col">${this.category}</td>`;
      tbody.append(row);
      table.classList.add('table-bordered');
    }
  }

  data.forEach(element => {
    new createRows(element[0], element[1], element[2], element[3]).render();
  });
});


